#### Data Inconsistencies
    1 - Inconsistent Formats ( of data e.g wrong data type or format ) 
        - converting multiple data with different formats into single non format
    2 - Inconsistent Naming Conventions
        - eg USA, US, United States, United States of America are all the same. we have to make it consistent
    3 - Typographical Errors - mistakes in data entry
        - eg Pakistan written is Paakistan or pkistan
    4 - Duplication
    5 - Contradictory Data
        - when multiple data contradicts each other e.g fathers age < sons age

In [1]:
import pandas as pd

In [15]:
data = {
    'date': ['2021-12-01', '01-12-2022', '2022/12/01', '12-01-2021'],
    'country': ['USA', 'U.S.A.', 'America', 'United States'],
    'name': ['John Doe','Jonh Doe', 'Jane Doe', 'Jane Doe'],
    'sales_2020': [100, 200, None, 200],
    'sales_2021': [None, 150, 300, 150]
}

df = pd.DataFrame(data)

In [16]:
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1  01-12-2022         U.S.A.  Jonh Doe       200.0       150.0
2  2022/12/01        America  Jane Doe         NaN       300.0
3  12-01-2021  United States  Jane Doe       200.0       150.0

In [10]:
# Standardizing the date format
df['date'] = pd.to_datetime(df['date'], errors='coerce')

In [11]:
df.head()

        date        country      name  sales_2020  sales_2021
0 2021-12-01            USA  John Doe       100.0         NaN
1        NaT         U.S.A.  Jonh Doe       200.0       150.0
2        NaT        America  Jane Doe         NaN       300.0
3        NaT  United States  Jane Doe       200.0       150.0

In [17]:
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df['date'] = df['date'].dt.strftime('%Y-%m-%d')
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1         NaN         U.S.A.  Jonh Doe       200.0       150.0
2         NaN        America  Jane Doe         NaN       300.0
3         NaN  United States  Jane Doe       200.0       150.0

In [21]:
df['date'] = df['date'].fillna(df['date'].mode()[0])

In [22]:
df.head()

         date        country      name  sales_2020  sales_2021
0  2021-12-01            USA  John Doe       100.0         NaN
1  2021-12-01         U.S.A.  Jonh Doe       200.0       150.0
2  2021-12-01        America  Jane Doe         NaN       300.0
3  2021-12-01  United States  Jane Doe       200.0       150.0